Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationParallel Property
 Cannot create specified fillet at rail path corner because of the curves are already smoothed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailFilletCreationParallel { get; }
Public Shared ReadOnly Property ContinuousRailFilletCreationParallel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailFilletCreationParallel {
	FailureDefinitionId^ get ();
}
static member ContinuousRailFilletCreationParallel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace